In [1]:
import pandas as pd 
import numpy as np

In [2]:
df=pd.read_csv('DataAnalyst.csv')

In [3]:
df.sample(5)

,Unnamed: 0,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors,Easy Apply
1019,1019,Data Analyst - Financial Advisor Services,$46K-$102K (Glassdoor est.),The FAS Data and Analytics group has an exciti...,3.2,Vanguard\n3.2,"Scottsdale, AZ","Malvern, PA",10000+ employees,1975,Company - Private,Investment Banking & Asset Management,Finance,Unknown / Non-Applicable,"Charles Schwab, Fidelity Investments, Edward J...",-1
1338,1338,Performance Improvement Data Analyst,$24K-$48K (Glassdoor est.),The Quality Data Analyst is responsible for su...,4.0,Texas Scottish Rite Hospital for Children\n4.0,"Dallas, TX","Dallas, TX",1001 to 5000 employees,1921,Nonprofit Organization,Health Care Services & Hospitals,Health Care,Unknown / Non-Applicable,-1,-1
970,970,Senior Data Analyst,$53K-$94K (Glassdoor est.),"Integrate is a rapidly growing, venture-backed...",4.4,Integrate\n4.4,"Phoenix, AZ","Phoenix, AZ",201 to 500 employees,2010,Company - Private,Enterprise Software & Network Solutions,Information Technology,$25 to $50 million (USD),-1,-1
1063,1063,Marketing Data Analyst Coordinator,$45K-$78K (Glassdoor est.),"TAILWIND, a division of Audacious Studios is l...",-1.0,AUDACIOUS STUDIOS LLC,"Tempe, AZ","Tempe, AZ",Unknown,-1,Company - Private,-1,-1,Unknown / Non-Applicable,-1,-1
262,262,Healthcare Data/Reporting Analyst,$73K-$127K (Glassdoor est.),Position Summary\n\nA data management/analyst ...,3.1,Integrated Resources\n3.1,"New York, NY","Edison, NJ",201 to 500 employees,1996,Company - Private,Staffing & Outsourcing,Business Services,$25 to $50 million (USD),-1,-1

In [4]:
# taking features that are actyually important for the project 
# 1.Job Title 
# 2.job description 
# 3.Company name 
# 4.location 
# 5.Salary

In [5]:
df=df[['Job Title','Job Description','Company Name','Location','Salary Estimate']]

In [6]:
df.sample(5)

,Job Title,Job Description,Company Name,Location,Salary Estimate
25,Data Analyst,Data Analyst (Decision Science)\n\nHearst is a...,Hearst Communications\n4.0,"New York, NY",$37K-$66K (Glassdoor est.)
1145,Business Analyst/Data Domain Expert,RESPONSIBILITIES Provide exploratory analysis ...,"Numeric, LLC\n3.2","Philadelphia, PA",$37K-$44K (Glassdoor est.)
310,Data Analyst - CBCH,Job Type: Officer of Administration\nBargainin...,Columbia University Medical Center\n3.8,"New York, NY",$27K-$52K (Glassdoor est.)
1480,Marketing Data Analyst,"Join Joomag, one of the fastest growing digita...","Joomag, Inc.\n3.9","San Jose, CA",$110K-$190K (Glassdoor est.)
648,Sr. Data Analyst,COVID19 Hiring Notice: Dollar Shave Club has t...,Dollar Shave Club\n3.8,"Marina del Rey, CA",$42K-$66K (Glassdoor est.)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2253 entries, 0 to 2252
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Job Title        2253 non-null   object
 1   Job Description  2253 non-null   object
 2   Company Name     2252 non-null   object
 3   Location         2253 non-null   object
 4   Salary Estimate  2253 non-null   object
dtypes: object(5)
memory usage: 88.1+ KB

In [8]:
df.columns

Index(['Job Title', 'Job Description', 'Company Name', 'Location',
       'Salary Estimate'],
      dtype='object')

In [9]:
df.isnull().sum()

Job Title          0
Job Description    0
Company Name       1
Location           0
Salary Estimate    0
dtype: int64

In [10]:
df.dropna(inplace = True )

In [11]:
df.isnull().sum()

Job Title          0
Job Description    0
Company Name       0
Location           0
Salary Estimate    0
dtype: int64

In [12]:
df['text'] = df['Job Title'] + " " + df['Job Description']

In [13]:
df['text']=df['text'].str.lower()

In [14]:
df=df[['Job Title','Company Name','Location','Salary Estimate','text']]

In [15]:
df.sample(5)

,Job Title,Company Name,Location,Salary Estimate,text
768,Data Analyst,Diverse Lynx\n3.9,"Chicago, IL",$73K-$82K (Glassdoor est.),data analyst role: data analyst\nlocation: chi...
222,Lead Data Analyst,Attentive,"New York, NY",$41K-$78K (Glassdoor est.),lead data analyst about attentive:\nattentive ...
1939,Senior Data Analyst,Redfin\n3.4,"San Francisco, CA",$99K-$178K (Glassdoor est.),senior data analyst redfin is redefining real ...
1324,HR Data Analyst II,Federal Reserve Bank\n3.7,"Dallas, TX",$24K-$48K (Glassdoor est.),hr data analyst ii about the role:the human re...
1914,Data Analyst Chemist - Quality System Contractor,"Rodan and Fields, LLC\n2.3","San Francisco, CA",$57K-$104K (Glassdoor est.),data analyst chemist - quality system contract...

In [16]:
df[['text']].head()

                                                text
0  data analyst, center on immigration and justic...
1  quality data analyst overview\n\nprovides anal...
2  senior data analyst, insights & analytics team...
3  data analyst requisition numberrr-0001939\nrem...
4  reporting data analyst about fanduel group\n\n...

In [17]:
df=df.drop_duplicates(subset=['Job Title','Company Name','Location','text'])

In [18]:
df.sample(5)

,Job Title,Company Name,Location,Salary Estimate,text
1203,Data Analyst,CYNET SYSTEMS\n4.0,"San Antonio, TX",$37K-$68K (Glassdoor est.),data analyst job description:\nidentify and im...
1051,Business Intelligence - Data Analyst,Crisis Response Network\n3.8,"Tempe, AZ",$43K-$94K (Glassdoor est.),business intelligence - data analyst business ...
834,Senior Data Analyst,Trilogy Behavioral Health,"Chicago, IL",$42K-$76K (Glassdoor est.),senior data analyst trilogy behavioral healthc...
624,Automotive Data Analyst,MotorTrend Group\n2.7,"El Segundo, CA",$35K-$45K (Glassdoor est.),automotive data analyst machines that move us....
627,Senior Data Insights Analyst,Endpoint Closing,"El Segundo, CA",$35K-$45K (Glassdoor est.),senior data insights analyst endpoint\nreal es...

In [19]:
df.shape

(2252, 5)

In [20]:
from sklearn.feature_extraction.text import TfidfVectorizer
tfidf=TfidfVectorizer(max_features=10000,stop_words='english')

In [21]:
job_vectors=tfidf.fit_transform(df['text'])

In [22]:
job_vectors.shape

(2252, 10000)

In [23]:
job_vectors=tfidf.fit_transform(df['text']).toarray()

In [24]:
job_vectors

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]], shape=(2252, 10000))

In [25]:
from sklearn.metrics.pairwise import cosine_similarity

In [26]:
user_text="python sql pandas excel dashboard"

In [27]:
user_vector=tfidf.transform([user_text.lower()]) # why we are not added fit here bcz we already make it learnt now i just have to call

In [28]:
similarity=cosine_similarity(user_vector,job_vectors).flatten() # what does flatten do here susppose the result gives 2D list 1 X n(no. of jobs ) then flatten will convert it to n dimension means 1d array ..

In [29]:
top_indices=np.argsort(similarity)[::-1][:5]

In [30]:
result=df.iloc[top_indices][['Job Title','Company Name','Location','Salary Estimate']].copy()
result['math_percentage']=(similarity[top_indices]*100).round(2)

In [31]:
result.head(8)

,Job Title,Company Name,Location,Salary Estimate,math_percentage
2083,Junior Data Analyst Python,Gallega Software Solutions Inc\n4.2,"Indianapolis, IN",$34K-$61K (Glassdoor est.),27.80
425,Data Analyst,"SunTechPros, Inc.\n4.3","Salt Lake City, UT",$26K-$47K (Glassdoor est.),23.50
925,Data Warehouse Analyst,Purity Technology LLC\n5.0,"Houston, TX",$47K-$76K (Glassdoor est.),22.35
578,Data Analyst - (Python),LEAPROS\n5.0,"Long Beach, CA",$57K-$103K (Glassdoor est.),18.52
1068,Sr Data Analyst,United BioSource\n2.3,"Blue Bell, PA",$41K-$78K (Glassdoor est.),17.30

In [32]:
SKILLS = [
    "python","sql","excel","pandas","numpy","power bi","tableau","matplotlib","seaborn",
    "statistics","machine learning","data analysis","data visualization","scikit-learn",
    "tensorflow","pytorch","nlp","git","streamlit","flask","mysql","postgresql","spark"
]

In [33]:
def extract(text):
    L = []
    text = str(text).lower()
    for skill in SKILLS:
        if skill in text:
            L.append(skill)
    return L

In [34]:
df['job_skills'] = df['text'].apply(extract)

In [35]:
df[['Job Title','job_skills']].head(5)

,Job Title,job_skills
0,"Data Analyst, Center on Immigration and Justic...","[python, sql, statistics, git]"
1,Quality Data Analyst,"[sql, excel, statistics, data analysis]"
2,"Senior Data Analyst, Insights & Analytics Team...","[python, sql, excel, tableau, data visualization]"
3,Data Analyst,"[sql, tableau, data analysis, data visualizati..."
4,Reporting Data Analyst,"[python, sql, excel, data analysis]"

In [36]:
df

,Job Title,Company Name,Location,Salary Estimate,text,job_skills
0,"Data Analyst, Center on Immigration and Justic...",Vera Institute of Justice\n3.2,"New York, NY",$37K-$66K (Glassdoor est.),"data analyst, center on immigration and justic...","[python, sql, statistics, git]"
1,Quality Data Analyst,Visiting Nurse Service of New York\n3.8,"New York, NY",$37K-$66K (Glassdoor est.),quality data analyst overview\n\nprovides anal...,"[sql, excel, statistics, data analysis]"
2,"Senior Data Analyst, Insights & Analytics Team...",Squarespace\n3.4,"New York, NY",$37K-$66K (Glassdoor est.),"senior data analyst, insights & analytics team...","[python, sql, excel, tableau, data visualization]"
3,Data Analyst,Celerity\n4.1,"New York, NY",$37K-$66K (Glassdoor est.),data analyst requisition numberrr-0001939\nrem...,"[sql, tableau, data analysis, data visualizati..."
4,Reporting Data Analyst,FanDuel\n3.9,"New York, NY",$37K-$66K (Glassdoor est.),reporting data analyst about fanduel group\n\n...,"[python, sql, excel, data analysis]"
...,...,...,...,...,...,...
2248,RQS - IHHA - 201900004460 -1q Data Security An...,"Avacend, Inc.\n2.5","Denver, CO",$78K-$104K (Glassdoor est.),rqs - ihha - 201900004460 -1q data security an...,[]
2249,Senior Data Analyst (Corporate Audit),Arrow Electronics\n2.9,"Centennial, CO",$78K-$104K (Glassdoor est.),senior data analyst (corporate audit) position...,"[sql, tableau, statistics, data analysis, data..."
2250,"Technical Business Analyst (SQL, Data analytic...",Spiceorb,"Denver, CO",$78K-$104K (Glassdoor est.),"technical business analyst (sql, data analytic...","[sql, excel]"
2251,"Data Analyst 3, Customer Experience",Contingent Network Services\n3.1,"Centennial, CO",$78K-$104K (Glassdoor est.),"data analyst 3, customer experience summary\n\...","[python, sql, machine learning, data analysis,..."
2252,Senior Quality Data Analyst,SCL Health\n3.4,"Broomfield, CO",$78K-$104K (Glassdoor est.),senior quality data analyst you.\n\nyou bring ...,"[excel, tableau, statistics, data analysis, git]"

In [42]:
import numpy as np
from sklearn.metrics.pairwise import cosine_similarity

def recommend(data, user_text, top_n=5):
    user_text = str(user_text).lower()
    user_skills = set(extract(user_text))

    user_vector = tfidf.transform([user_text])
    scores = cosine_similarity(user_vector, job_vectors).flatten()

    top_indices = np.argsort(scores)[::-1][:top_n]

    result = data.iloc[top_indices][
        ['Job Title','Company Name','Location','Salary Estimate','job_skills']
    ].copy()

    result['match_percent'] = (scores[top_indices] * 100).round(2)
    result['missing_skills'] = result['job_skills'].apply(
        lambda js: sorted(list(set(js) - user_skills))
    )

    return result[['Job Title','Company Name','Location','Salary Estimate','match_percent','missing_skills']]

In [43]:
df.columns

Index(['Job Title', 'Company Name', 'Location', 'Salary Estimate', 'text',
       'job_skills'],
      dtype='object')

In [45]:
recommend(df,"python sql excel pandas ",top_n=5)

,Job Title,Company Name,Location,Salary Estimate,match_percent,missing_skills
2083,Junior Data Analyst Python,Gallega Software Solutions Inc\n4.2,"Indianapolis, IN",$34K-$61K (Glassdoor est.),33.39,[data visualization]
425,Data Analyst,"SunTechPros, Inc.\n4.3","Salt Lake City, UT",$26K-$47K (Glassdoor est.),28.22,"[numpy, spark]"
578,Data Analyst - (Python),LEAPROS\n5.0,"Long Beach, CA",$57K-$103K (Glassdoor est.),22.25,"[data analysis, tableau]"
419,Sr. Data Analyst,TekniSMart Solutions\n3.8,"Franklin Lakes, NJ",$48K-$96K (Glassdoor est.),17.13,[tableau]
142,Data Analyst,Precision technologies corp\n4.2,"New York, NY",$59K-$85K (Glassdoor est.),17.08,"[data visualization, git, spark, tableau]"